
## 3.3: WHERE met LIKE


<p>Na de `WHERE` kun je met `LIKE` zoeken naar delen van 
teksten, of wanneer je iets ongeveer wilt zoeken. Met de joker geef je aan welke teken(s) anders mogen zijn. De procent 
teken '%' vervangt nul of meerdere tekens.

Let op:
<ul>
<li>Je gebruikt LIKE na WHERE;
<li>De joker varvangt nul of meerdere tekens;
<li>Je moet bij de LIKE aanhalingstekens gebruiken.
</ul>



<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">
Bijvoorbeeld, om alle namen te die beginnen met ‘Jo’ (zoals Josette, Johan) gebruik je:

```SQL
SELECT naam
FROM klant
WHERE naam LIKE 'J%';
```
</td><td width="65%">
<table border="1">
  <thead>
    <tr>
      <th>naam</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Josette Soede</td></tr>
    <tr><td>Jolanda Budding-Doornbos</td></tr>
    <tr><td>Joanne Vlastuin</td></tr>
    <tr><td>Jolanda Knoop - Hoek</td></tr>
    <tr><td>Joost Nieuwboer</td></tr>
    <tr><td>Johan van Nierop</td></tr>
  </tbody>
</table>
</td></tr></table>


<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">
Bijvoorbeeld, met de volgende query tonen we de pizza's met een naam die <i>begint met</i> '<b>Quattro</b>':

```SQL
SELECT naam
FROM pizza
WHERE naam LIKE 'Quattro%';
```
</td><td width="65%">
<table border="1">
  <thead>
    <tr>
      <th>naam</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Quattro formaggi</td></tr>
    <tr><td>Quattro stragioni</td></tr>
  </tbody>
</table>
</td></tr></table>



<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">
Of die <i>eindigt op</i> '<b>arma</b>':

```SQL
SELECT naam
FROM pizza
WHERE naam LIKE '%arma';
```
</td><td width="65%">
<table border="1">
  <thead>
    <tr>
      <th>naam</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Shoarma</td></tr>
    <tr><td>Parma</td></tr>
  </tbody>
</table>
</td></tr></table>


<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">
Of waarbij de letter '<b>e</b>' <i>erin voorkomt</i>:

```SQL
SELECT naam
FROM pizza
WHERE naam LIKE '%e%';
```
</td><td width="65%">
  <table border="1">
  <thead>
    <tr>
      <th>naam</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Margherita</td></tr>
    <tr><td>Napoletana</td></tr>
    <tr><td>Salame</td></tr>
    <tr><td>...</td></tr>
    <tr><td>Combinazione</td></tr>
  </tbody>
</table>

</td></tr></table>

### Verwerkingsopdracht 3.3.1 Alle pizza's waar de letter 'a' in voorkomt

<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">

Toon een overzicht van alle pizza's waar de letter '<b>a</b>' in voorkomt:

</td><td width="65%">
    <table border="1">
  <thead>
    <tr>
      <th>naam</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Margherita</td></tr>
    <tr><td>Napoletana</td></tr>
    <tr><td>Salame</td></tr>
    <tr><td>...</td></tr>
    <tr><td>Combinazione</td></tr>
  </tbody>
</table>

</td></tr></table>

<p>Bekijk <a href="https://rweeda.github.io/PythonIA/docs/IA_sql_oplossingen.html#opgave331" target="_blank">hier</a> de voorbeelduitwerking.</p>
<!-- ANTWOORD:
<pre><code class="language-sql">
SELECT naam
FROM pizza
WHERE naam LIKE '%a%';
</code></pre>
-->

### Verwerkingsopdracht 3.3.2 Alle klanten met een mobiele telefoonnummer

<table width="100%"><tr><td style="text-align:left; vertical-align:top; font-size:1.25rem;" width="35%">
Toon een overzicht met <b>naam</b> en <b>telefoonnummer</b> van elk klant die een 06-nummer heeft opgegeven.
</td><td width="65%">
    <table border="1">
  <thead>
    <tr>
      <th>naam</th>
      <th>telefoon</th>
    </tr>
  </thead>
  <tbody>
    <tr><td>Hanneke Bolier</td><td>06-16915427</td></tr>
    <tr><td>Erika de Vries</td><td>06-79118502</td></tr>
    <tr><td>Josette Soede</td><td>06-56149758</td></tr>
    <tr><td>Antje van de Brink-Cromwi</td><td>06-17101504</td></tr>
    <tr><td>Neeltje Blankenstijn</td><td>06-51872409</td></tr>
    <tr><td>...</td><td>...</td></tr>
  </tbody>
</table>

</td></tr></table>



<p>Bekijk <a href="https://rweeda.github.io/PythonIA/docs/IA_sql_oplossingen.html#opgave332" target="_blank">hier</a> de voorbeelduitwerking.</p>
<!-- ANTWOORD:
<pre><code class="language-sql">
SELECT naam, telefoon
FROM klant
WHERE telefoon LIKE '06%';
</code></pre>
-->